Revit 2026 API

# DocumentGetCloudModelUrn Method

---

A ForgeDM Urn identifying the model.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GetCloudModelUrn()
```
```vb
Public Function GetCloudModelUrn As String
```
```cpp
public:
String^ GetCloudModelUrn()
```
```fsharp
member GetCloudModelUrn : unit -> string
```

#### Return Value

String

| Exception | Condition |
| --- | --- |
| RevitServerUnauthorizedException | Thrown when cannot get data from ForgeDM. |

It is empty for non-cloud model; It is cached in Revit model opened session after getting it;

#### Reference

Document Class

Autodesk.Revit.DB Namespace